using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace InfoPole.Tests.TestData
{
    class FileDataLines
    {
        public static string GetSpyWordsDataLine()
        {
            return "\"рив гош\";\"38,92\";\"30 017\";\"1\";\"\";\"Главная страница | РИВ ГОШ - сеть магазинов косметики и ... / Обращаем ваше внимание, что участились случаи мошеннических действий с использованием коммерческого обозначения РИВ ГОШ. В том числе, появились сайты-клоны, не только копирующие дизайн официального сайта РИВ ГОШ www.rivegauche.ru, но и использующие похожее доменное имя. Просим ... / www.rivegauche.ru/\";\"http://rivegauche.ru\";";

        }

        public static IEnumerable<string> GetSpyWordsDataLines()
        {
            return new []
            {
                "\"рив гош\";\"38,92\";\"30 017\";\"1\";\"\";\"Главная страница | РИВ ГОШ - сеть магазинов косметики и ... / Обращаем ваше внимание, что участились случаи мошеннических действий с использованием коммерческого обозначения РИВ ГОШ. В том числе, появились сайты-клоны, не только копирующие дизайн официального сайта РИВ ГОШ www.rivegauche.ru, но и использующие похожее доменное имя. Просим ... / www.rivegauche.ru/\";\"http://rivegauche.ru\";",
                "\"рив гош интернет-магазин\";\"4,49\";\"9 438\";\"2\";\"\";\"Онлайн-магазин | РИВ ГОШ - сеть магазинов косметики и ... / В. Адрес для корреспонденции: 190005, г. Санкт-Петербург, Митрофаньевское шоссе, д. 2, корпус 9, лит. В. Электронная почта: shopadmin@rivegauche.ru. ТЕЛЕФОН: 8-800-333-20-20. ЕЖЕДНЕВНО с 8:00 до 22:00 (по московскому времени). ПЕРЕЙТИ В ИНТЕРНЕТ-МАГАЗИН ПАРФЮМЕРИИ И КОСМЕТИКИ ... / www.rivegauche.ru Магазины РИВ ГОШ\";\"http://rivegauche.ru/shops/shops-on-line\";",
                "\"рив-гош интернет магазин\";\"4,05\";\"8 523\";\"2\";\"\";\"Онлайн-магазин | РИВ ГОШ - сеть магазинов косметики и ... / В. Адрес для корреспонденции: 190005, г. Санкт-Петербург, Митрофаньевское шоссе, д. 2, корпус 9, лит. В. Электронная почта: shopadmin@rivegauche.ru. ТЕЛЕФОН: 8-800-333-20-20. ЕЖЕДНЕВНО с 8:00 до 22:00 (по московскому времени). ПЕРЕЙТИ В ИНТЕРНЕТ-МАГАЗИН ПАРФЮМЕРИИ И КОСМЕТИКИ ... / www.rivegauche.ru Магазины РИВ ГОШ\";\"http://rivegauche.ru/shops/shops-on-line\";",
                "\"интернет магазин рив гош\";\"3,95\";\"8 313\";\"2\";\"\";\"Онлайн-магазин | РИВ ГОШ - сеть магазинов косметики и ... / В. Адрес для корреспонденции: 190005, г. Санкт-Петербург, Митрофаньевское шоссе, д. 2, корпус 9, лит. В. Электронная почта: shopadmin@rivegauche.ru. ТЕЛЕФОН: 8-800-333-20-20. ЕЖЕДНЕВНО с 8:00 до 22:00 (по московскому времени). ПЕРЕЙТИ В ИНТЕРНЕТ-МАГАЗИН ПАРФЮМЕРИИ И КОСМЕТИКИ ... / www.rivegauche.ru Магазины РИВ ГОШ\";\"http://rivegauche.ru/shops/shops-on-line\";",
                "\"rivegauche\";\"2,00\";\"1 541\";\"1\";\"\";\"Главная страница | РИВ ГОШ - сеть магазинов косметики и ... / Обращаем ваше внимание, что участились случаи мошеннических действий с использованием коммерческого обозначения РИВ ГОШ. В том числе, появились сайты-клоны, не только копирующие дизайн официального сайта РИВ ГОШ www.rivegauche.ru, но и использующие похожее доменное имя. Просим ... / www.rivegauche.ru/\";\"http://rivegauche.ru\";"
            };
        }

        public static string GetKeysSoDataLine()
        {
            return "9198;рив гош день рождения клиента;http://rivegauche.ru/discount/birthday;1;294;88;128000000";
        }

        public static IEnumerable<string> GetKeysSoDataLines()
        {
            return new[]
            {
                "9198;рив гош день рождения клиента;http://rivegauche.ru/discount/birthday;1;294;88;128000000",
                "10524;рив гош тверской пассаж;http://rivegauche.ru/image-studio/tverskoy-passazh;1;18;7;53000000",
                "5449;каталог рив гош официальный сайт;http://rivegauche.ru/;1;10931;14;145000000",
                "5449;рив гош вологда каталог товаров;http://rivegauche.ru/;1;150;17;82000000",
                "5449;щелково рив гош;http://rivegauche.ru/;1;36;1;32000000"
            };
        }

        public static IEnumerable<string> GetMarkupTagsDataLines()
        {
            return
                new[]
                {
                    "купить;в;не;как;я;видео;нанять;Санкт-Петербург;Москва;Москва;Александров;Киев;Минск;Абай;академическая;aliexpress;бесплатно;недорого;самостоятельно;ахере;abortion;аалия;аамир",
                    "онлайн; от; ничто; откуда; они; лучший; профессия; Самара; Нижний Новгород; Омск; Волоколамск; Николаев; Пинск; Алга; видное; ozon; даром; бонусный; индивидуально; бейцы; arse; авдотья; абдула"
                };

        }
    }
}
